ИнКар.Маркетплейсы/src/InformationRegisters/МП_КатегорииYML/МП_КатегорииYML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_КатегорииYML</name>
  <resources>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>parentId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвитоПодкатегорияТоваров</name>
    <type>
      <types>CatalogRef.МП_АвитоПодкатегорииТоваров</types>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/Enums/МП_ВариантыПубликацииКартинок/МП_ВариантыПубликацииКартинок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_ВариантыПубликацииКартинок</name>
  <enumValues>
    <name>НеПубликовать</name>
  </enumValues>
  <enumValues>
    <name>ТолькоОсновную</name>
  </enumValues>
  <enumValues>
    <name>ПубликоватьВсе</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Enums/ТипыХраненияФайлов/ТипыХраненияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыХраненияФайлов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВИнформационнойБазе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВТомахНаДиске</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Catalogs/НоменклатураПрисоединенныеФайлы/НоменклатураПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураПрисоединенныеФайлы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВладелецФайла</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Том</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ИнКар.Маркетплейсы/src/CommonModules/МП_YMLВызовСервера/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Область Информация
//
//		https://baza.drom.ru/help/XmlPriceCreate1
//======================================================================================================================		
//		Для раздела "Автозапчасти":  
//			- Укажите применимость ав​тозапчасти: это повысит пользовательский интерес к Вашему товару;
//			- Размещайте информацию о каждом параметре в отдельные теги: марка, модель, кузов, двигатель, ОЕМ-номер,
//			  номера-аналоги, год, цвет, производитель.
//----------------------------------------------------------------------------------------------------------------------			   
//<?xml version="1.0" encoding="UTF-8"?>
//
//<offers>
//    <offer>
//        <name>Амортизатор</name>
//        <oem_number>334388</oem_number>
//        <analog_numbers>4853033281,4853033291,4853039885,DS2130GS </analog_numbers>
//        <manufacturer>KYB</manufacturer>
//        <ordercode>577</ordercode>
//        <condition>Б/у</condition>
//        <brandcars>Honda</brandcars>
//        <modelcars>Airwave</modelcars>
//        <bodycars>GJ1</bodycars>
//        <engine>1MZFE</engine>
//        <year>2002</year>
//        <lr>лево</lr>
//        <fr>перед</fr>
//        <ud>низ</ud>
//        <color></color>
//    </offer>
//</offers>
//======================================================================================================================
//		Для других разделов:
//----------------------------------------------------------------------------------------------------------------------
//<?xml version="1.0" encoding="UTF-8"?>
//<!DOCTYPE yml_catalog SYSTEM "shops.dtd">
//
//<yml_catalog date="2010-04-01 17:00">
//    <shop>
//        <offers>
//            <offer id="12341">
//                <name>Каталка</name>
//                <description>Качалка Smoby 412008; Тип: Каталка </description>
//                <price>8240</price>
//                <currencyId>RUR</currencyId>
//                <picture>http://ismoby.ru/products_pictures/412006_Z_vue02_enl.jpg</picture>
//            </offer>
//        </offers>
//    </shop>
//</yml_catalog>
//
//======================================================================================================================
//	https://baza.drom.ru/help/API - Обновление прайс-листов по API (не реализовано) 
//	
#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область ПакетныеМетоды
// Методы, предназначенные для пакетной обработки обмена с сайтом Авито.
// Пригодны для запуска в качестве регламентного задания

Процедура СформироватьПрайсы() Экспорт

	НаборПрофилей = Справочники.УдалитьМП_ДромПрофили.ГотовыКАвтозагрузке();

	Для Каждого Профиль Из НаборПрофилей Цикл
		СформироватьПрайс(Профиль);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область МетодыПрофилей

Функция СформироватьПрайс(Профиль) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ИмяЭлементаИзображений = "picture";

	Результат = Новый Структура("Сообщение, Ошибки");

	Если ЗначениеЗаполнено(Профиль) Тогда

		ПараметрыПрофиля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Профиль, Реквизиты());

		ПубликоватьВсеКартинки = (ПараметрыПрофиля.ПубликоватьКартинки
								  = Перечисления.МП_ВариантыПубликацииКартинок.ПубликоватьВсе);
		ПубликоватьПрименимость = (Метаданные.НайтиПоПолномуИмени("Подсистема.АвтосервисАвтомагазин") <> Неопределено);

		ОбновитьРегистр(ПараметрыПрофиля);

		ЗапросТовары = ИнициализироватьЗапросТовары(ПараметрыПрофиля);
		НаВыгрузку = ЗапросТовары.Выполнить().Выбрать();

		Если НаВыгрузку.Количество() > 0 Тогда

			Если ПубликоватьВсеКартинки Тогда
				ЗапросКартинок = ИнициализироватьЗапросКартинок();
			КонецЕсли;

			ПоляИзЗапроса = ПоляИзЗапроса();

			ДокDOM = Новый ДокументDOM(ПространствоИменДром(), "yml_catalog");

			КорневойУзел = ДокDOM.ДочерниеУзлы.Элемент(0);
			ДатаВремя = Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd HH:mm'");
			КорневойУзел.УстановитьАтрибут("date", ДатаВремя);
			

			// Описание магазина
			ОписаниеМагазина = ДокDOM.СоздатьЭлемент("shop");

			НаименованиеМагазина = ДокDOM.СоздатьЭлемент("name");
			НаименованиеМагазина.ТекстовоеСодержимое = ПараметрыПрофиля.Shop_name;

			НаименованиеКомпании = ДокDOM.СоздатьЭлемент("company");
			НаименованиеКомпании.ТекстовоеСодержимое = ПараметрыПрофиля.Shop_company;

			Сайт = ДокDOM.СоздатьЭлемент("url");
			Сайт.ТекстовоеСодержимое = ПараметрыПрофиля.Shop_url;

			ЭлектроннаяПочта = ДокDOM.СоздатьЭлемент("email");
			ЭлектроннаяПочта.ТекстовоеСодержимое = ПараметрыПрофиля.Shop_email;
			
			// Описание магазина - секция currencies
			Валюта = ДокDOM.СоздатьЭлемент("currency");
			Валюта.УстановитьАтрибут("id", "RUR");
			Валюта.УстановитьАтрибут("rate", "1");

			СписокВалют = ДокDOM.СоздатьЭлемент("currencies");
			СписокВалют.ДобавитьДочерний(Валюта);
			
			// Описание магазина - секция categories
			СписокКатегорий = РегистрыСведений.МП_КатегорииYML.РазделКатегорииМагазина(ДокDOM);
 
			// Формирование узла описания магазина			
			ОписаниеМагазина.ДобавитьДочерний(НаименованиеМагазина);
			ОписаниеМагазина.ДобавитьДочерний(НаименованиеКомпании);
			ОписаниеМагазина.ДобавитьДочерний(Сайт);
			ОписаниеМагазина.ДобавитьДочерний(ЭлектроннаяПочта);
			ОписаниеМагазина.ДобавитьДочерний(СписокВалют);
			ОписаниеМагазина.ДобавитьДочерний(СписокКатегорий);

			СписокПредложений = ДокDOM.СоздатьЭлемент("offers");

			Пока НаВыгрузку.Следующий() Цикл

				ЕстьХарактеристики = Ложь;

				ОбъявлениеDOM = ДокDOM.СоздатьЭлемент("offer");
				ОбъявлениеDOM.УстановитьАтрибут("id", Строка(Формат(НаВыгрузку.id, "ЧГ=0;")));
				
				// Создание элементов из полей запроса
				Для Каждого Поле Из ПоляИзЗапроса Цикл
					Если ЗначениеЗаполнено(НаВыгрузку[Поле]) Тогда
						Элемент = ДокDOM.СоздатьЭлемент(Поле);
						ПолеНаВыгрзку = ?(ТипЗнч(НаВыгрузку[Поле]) = Тип("Число"),
										  Формат(НаВыгрузку[Поле], "ЧГ=0;"),
										  НаВыгрузку[Поле]);
						Элемент.ТекстовоеСодержимое = Строка(ПолеНаВыгрзку);
						ОбъявлениеDOM.ДобавитьДочерний(Элемент);
					КонецЕсли;
				КонецЦикла;

				// Текст объявления

				ТО = Новый Массив;

				// Секция Шапка
				Если СтрДлина(ПараметрыПрофиля.Шапка) > 0 Тогда
					ТО.Добавить(ПараметрыПрофиля.Шапка);
					ТО.Добавить(Символы.ПС);
				КонецЕсли;

				// Секция Описание номенклатуры
				Если СтрДлина(НаВыгрузку.НоменклатураОписание) > 4 Тогда
					ТО.Добавить(НаВыгрузку.НоменклатураОписание);
					ТО.Добавить(Символы.ПС);
				КонецЕсли;

				// Секция применимость
				Если ПубликоватьПрименимость Тогда
					Модели = Новый Массив;
					Выполнить ("Справочники.КА2_КлючиМоделей.НайтиПоНоменклатуреДляДром(НаВыгрузку.Номенклатура, НаВыгрузку.Характеристика, Модели)");

					Если Модели.Количество() > 0 Тогда
						ТО.Добавить("Подходит для следующих моделей автомобилей:");
						ТО.Добавить(Символы.ПС);

						Для Каждого Элемент Из Модели Цикл
							СтрокаМодель = СтрШаблон("  - %1 %2 (%3, %4) %5",
													 Элемент.brandcars,
													 Элемент.modelcars,
													 Элемент.year,
													 Элемент.generation,
													 Элемент.bodycars);
							ТО.Добавить(СтрокаМодель);
							ТО.Добавить(Символы.ПС);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;				

				// Секция характеристики
				ДопРеквизиты = УправлениеСвойствами.ЗначенияСвойств(НаВыгрузку.Номенклатура, Истина, Ложь);

				Для Каждого ДР Из ДопРеквизиты Цикл
					РеквизитыДР = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДР.Свойство, "Имя, Заголовок");
					Если МП_УниверсальныеМетодыВызовСервера.ДРПодлежитПубликации(РеквизитыДР.Имя) Тогда
						
						// При необходимости добавляем заголовок списка
						Если Не ЕстьХарактеристики Тогда

							ТО.Добавить(Символы.ПС);
							ТО.Добавить("Характеристики товара:");
							ТО.Добавить(Символы.ПС);

							ЕстьХарактеристики = Истина;

						КонецЕсли;

						ТО.Добавить(Символы.ПС);
						ТО.Добавить(РеквизитыДР.Заголовок);
						ТО.Добавить(" -- ");
						ТО.Добавить(Строка(ДР.Значение));

					КонецЕсли;

				КонецЦикла;

				Если ЕстьХарактеристики Тогда
					ТО.Добавить(Символы.ПС);
					ТО.Добавить(Символы.ПС);
				КонецЕсли;

				// Секция Подвал
				Если СтрДлина(ПараметрыПрофиля.Подвал) > 0 Тогда
					ТО.Добавить(ПараметрыПрофиля.Подвал);
					ТО.Добавить(Символы.ПС);
				КонецЕсли;
				
				// Создание элемента Description
				ТекстОбъявления = СтрСоединить(ТО);

				Если СтрДлина(ТекстОбъявления) > 0 Тогда
					Элемент = ДокDOM.СоздатьЭлемент("description");
					Элемент.ТекстовоеСодержимое = ТекстОбъявления;
					ОбъявлениеDOM.ДобавитьДочерний(Элемент);
				КонецЕсли;
						
				// Секция картинок
				Если ПубликоватьВсеКартинки Тогда

					ЗапросКартинок.УстановитьПараметр("ВладелецФайла", НаВыгрузку.Номенклатура);
					НаборИзображений = ЗапросКартинок.Выполнить().Выбрать();

					Пока НаборИзображений.Следующий() Цикл

						URLИзображения = ПараметрыПрофиля.URLЗагрузки + НаборИзображений.ПутьКФайлу;
						ЭлементКартинка = ДокDOM.СоздатьЭлемент(ИмяЭлементаИзображений);
						ЭлементКартинка.ТекстовоеСодержимое = URLИзображения;
						ОбъявлениеDOM.ДобавитьДочерний(ЭлементКартинка);

					КонецЦикла;

				КонецЕсли;

				// Секция categoryId
				Категория = ДокDOM.СоздатьЭлемент("categoryId");
				Категория.ТекстовоеСодержимое = Формат(НаВыгрузку.categoryId, "ЧГ=0;");
				ОбъявлениеDOM.ДобавитьДочерний(Категория);
				
				// Добавление объявления в список объявлений
				СписокПредложений.ДобавитьДочерний(ОбъявлениеDOM);

			КонецЦикла;

			// Добавление списка предложений в описание магазина
			ОписаниеМагазина.ДобавитьДочерний(СписокПредложений);
				
			// Добавление магазина в DOM
			КорневойУзел.ДобавитьДочерний(ОписаниеМагазина);

			// Сохранение ДокументDOM в файл
			Если ДокDOM.ЕстьДочерниеУзлы() Тогда
				МП_УниверсальныеМетодыВызовСервера.СохранитьДокументDOMВФайле(ДокDOM,
																			  ПараметрыПрофиля.ИмяФайлаВыгрузки,
																			  ПространствоИменДром());
			КонецЕсли;

		КонецЕсли;

	Иначе
		Результат.Вставить("Ошибки", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Не задан профиль"));
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции

Функция ОбновитьРегистр(ПараметрыПрофиля)

	Сегмент = ПараметрыПрофиля.Сегмент;
	Профиль = ПараметрыПрофиля.Ссылка;
	
	// Установка всех объявлений в статус не активно
	НаборЗаписей = РегистрыСведений.УдалитьМП_ПредложенияYML.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Профиль.Установить(Профиль, Истина);

	НаборЗаписей.Прочитать();

	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ЭтоАктивноеОбъявление = Ложь;
	КонецЦикла;

	НаборЗаписей.Записать(Истина);
	
	// Перезаполнение объявлений по сегменту
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сегмент", Сегмент);
	Запрос.УстановитьПараметр("Профиль", Профиль);

	Запрос.Текст = "ВЫБРАТЬ
				   |	НоменклатураСегмента.Номенклатура КАК Номенклатура,
				   |	НоменклатураСегмента.Характеристика КАК Характеристика,
				   |	&Профиль КАК Профиль,
				   |	НоменклатураСегмента.Номенклатура.Код КАК id,
				   |	НоменклатураСегмента.Номенклатура.Наименование КАК name,
				   |	ИСТИНА КАК ЭтоАктивноеОбъявление
				   |ИЗ
				   |	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
				   |ГДЕ
				   |	НоменклатураСегмента.Сегмент = &Сегмент";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		НоваяЗапись = РегистрыСведений.УдалитьМП_ПредложенияYML.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Записать(Истина);	
		
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает массив реквизитов профиля
// 
// Возвращаемое значение:
//  Массив - Реквизиты
Функция Реквизиты()

	Реквизиты = Новый Массив;

	Реквизиты.Добавить("Ссылка");
	Реквизиты.Добавить("Сегмент");
	Реквизиты.Добавить("URLЗагрузки");
	Реквизиты.Добавить("ПубликоватьКартинки");
	Реквизиты.Добавить("ВариантФормированияНаличия");
	Реквизиты.Добавить("СкладОсновной");
	Реквизиты.Добавить("ИмяФайлаВыгрузки");

	Реквизиты.Добавить("ВидЦены");
	Реквизиты.Добавить("Скидка");

	Реквизиты.Добавить("Шапка");
	Реквизиты.Добавить("Подвал");

	Реквизиты.Добавить("Shop_name");
	Реквизиты.Добавить("Shop_company");
	Реквизиты.Добавить("Shop_url");
	Реквизиты.Добавить("Shop_email");

	Возврат Реквизиты

КонецФункции

Функция ИнициализироватьЗапросКартинок()

	Перем ЗапросКартинок;
	ЗапросКартинок = Новый Запрос;
	ЗапросКартинок.УстановитьПараметр("ТипХраненияФайла", Перечисления.ТипыХраненияФайлов.ВТомахНаДиске);

	ЗапросКартинок.Текст = "ВЫБРАТЬ
						   |	НоменклатураПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
						   |	НоменклатураПрисоединенныеФайлы.Том.ПолныйПутьWindows КАК Том
						   |ИЗ
						   |	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
						   |ГДЕ
						   |	НоменклатураПрисоединенныеФайлы.ТипХраненияФайла = &ТипХраненияФайла
						   |	И НоменклатураПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	Возврат ЗапросКартинок

КонецФункции

Функция ИнициализироватьЗапросТовары(ПараметрыПрофиля)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сегмент", ПараметрыПрофиля.Сегмент);
	Запрос.УстановитьПараметр("ВидЦены", ПараметрыПрофиля.ВидЦены);
	Запрос.УстановитьПараметр("Скидка", ПараметрыПрофиля.Скидка);

	Запрос.Текст = "ВЫБРАТЬ
				   |	ЕСТЬNULL(Цены.Цена, 0) * (100 - &Скидка) / 100 КАК price,
				   |	""RUR"" КАК currencyId,
				   |	ЕСТЬNULL(Производители.Представление, """") КАК vendor,
				   |	""Новый"" КАК condition,
				   |	""true"" КАК store,
				   |	МП_ПредложенияYML.Номенклатура КАК Номенклатура,
				   |	МП_ПредложенияYML.Характеристика КАК Характеристика,
				   |	МП_ПредложенияYML.Номенклатура.Наименование КАК name,
				   |	МП_ПредложенияYML.Номенклатура.Артикул КАК vendorCode,
				   |	МП_ПредложенияYML.Номенклатура.Описание КАК НоменклатураОписание,
				   |	МП_ПредложенияYML.id КАК id,
				   |	МП_КатегорииYML.id КАК categoryId
				   |ИЗ
				   |	РегистрСведений.УдалитьМП_ПредложенияYML КАК МП_ПредложенияYML
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Производители КАК Производители
				   |		ПО Производители.Ссылка = МП_ПредложенияYML.Номенклатура.Производитель
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК Цены
				   |		ПО Цены.Номенклатура = МП_ПредложенияYML.Номенклатура
				   |		И Цены.Характеристика = МП_ПредложенияYML.Характеристика
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МП_КатегорииYML КАК МП_КатегорииYML
				   |		ПО МП_КатегорииYML.Категория = МП_ПредложенияYML.Номенклатура.ВидНоменклатуры";
	Возврат Запрос

КонецФункции

Функция ПространствоИменДром()
	Возврат "https://www.drom.ru/";
КонецФункции

Функция ПоляИзЗапроса()

	Поля = Новый Массив;

	Поля.Добавить("name");
//	Поля.Добавить("description");
	Поля.Добавить("vendor");
	Поля.Добавить("vendorCode");
//	Поля.Добавить("condition");
	Поля.Добавить("price");
//	Поля.Добавить("currencyId");
	Поля.Добавить("store");
	Возврат Поля;

КонецФункции

Функция КоллекцияМоделейDOM(Номенклатура, Характеристика, ДокументDOM)

	КоллекцияМоделей = ДокументDOM.СоздатьЭлемент("cars");

	Модели = Новый Массив;
	Выполнить ("Справочники.КА2_КлючиМоделей.НайтиПоНоменклатуреДляДром(Номенклатура, Характеристика, Модели)");

	Если Модели.Количество() > 0 Тогда

		Для Каждого Эл Из Модели Цикл

			Модель = ДокументDOM.СоздатьЭлемент("car");

			Для Каждого Ключ Из Эл Цикл
				Если Не ПустаяСтрока(Ключ.Значение) Тогда
					МодельУзел = ДокументDOM.СоздатьЭлемент(Ключ.Ключ);
					МодельУзел.ТекстовоеСодержимое = Ключ.Значение;
					Модель.ДобавитьДочерний(МодельУзел);
				КонецЕсли;
			КонецЦикла;

			КоллекцияМоделей.ДобавитьДочерний(Модель);

		КонецЦикла;

	КонецЕсли;

	Возврат КоллекцияМоделей;

КонецФункции

#КонецОбласти
